БухЭксп/InformationRegisters/CW_ПараметрыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПараметрыПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Пользователи</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonModules/CW_ОбменГИСЭПДСервер/Ext/Module.bsl
// Заполняет основные сведения о библиотеке или основной конфигурации.
// 
// Параметры:
//  Описание - Структура:
//
//   * Имя                 - Строка - имя подсисетмы, например, "CW_БухгалтерияЭкспедитора".
//   * Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
Процедура ПриДобавленииПодсистем(ОписаниеПодсистем) Экспорт
	
	ОписаниеПодсистем.Вставить("CW_ОбменГИСЭПД", "8.3.1.2");
	
КонецПроцедуры   

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса, УстановленныеПараметры) Экспорт

	
КонецПроцедуры

Процедура ПолучитьШаблоныТекстовHTTPЗапросов(Результат) Экспорт

	Результат.Вставить("esd_activation",	"/%1/hs/esd/activation");    
  	Результат.Вставить("esd_autoinvoice",	"/%1/hs/esd/autoinvoice");    
	Результат.Вставить("esd_disable",		"/%1/hs/esd/disable");  
	Результат.Вставить("esd_info",			"/%1/hs/esd/info");  
	Результат.Вставить("esd_rates",			"/%1/hs/esd/rates");  
	Результат.Вставить("esd_reginfo",		"/%1/hs/esd/reginfo");  
	Результат.Вставить("esd_used",			"/%1/hs/esd/used");  
	
КонецПроцедуры  

Функция ПолучитьРегистрационнуюИнформациюСервиса() Экспорт
	
	СтруктураОтвет 			= Новый Структура;
	
	РегистрационныйНомер 	= CW_ПроверкаЛицензии.ПолучитьРегистрационныйНомер();
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("regnumber",	XMLСтрока(РегистрационныйНомер));
	СтруктураJSON.Вставить("service",	"ESD");
	
	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("esd_reginfo", СтруктураJSON);
	
	Если ПараметрыHTTPЗапроса.УказаныРегистрационныеДанные Тогда
		
		Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "GET"); 
		
		Если Ответ = Неопределено Тогда 
			ЗаписьЖурналаРегистрации("CW_ОбменГИСЭПД", УровеньЖурналаРегистрации.Ошибка,,,"Отсутствует интернет-соединение!",);
		Иначе
			
			Сообщение = Ответ.ПолучитьТелокакСтроку();
			
			Если Ответ.КодСостояния <> 200 Тогда    
				Если ПустаяСтрока(Сообщение) Тогда
					ОписаниеКодовСостояний 	= CW_ОбщийМодульЛичныйКабинетКлиентСервер.ПолучитьОписаниеКодовСостояний();	
					Сообщение = "Код ошибки: "+ Ответ.КодСостояния +" - "+ ОписаниеКодовСостояний.Получить(Ответ.КодСостояния); 
				КонецЕсли;  
				ЗаписьЖурналаРегистрации("Доходы нерезидента", УровеньЖурналаРегистрации.Ошибка,,,Сообщение,);
			Иначе
				
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(Сообщение);  
				
				СтруктураJSON = ПрочитатьJSON(ЧтениеJSON);
				ЧтениеJSON.Закрыть(); 
				
				СтруктураОтвет.Вставить("ДатаНачала", 		XMLЗначение(Тип("Дата"),	СтруктураJSON.ДатаНачала));
				СтруктураОтвет.Вставить("ДатаОкончания", 	XMLЗначение(Тип("Дата"),	СтруктураJSON.ДатаОкончания));
				СтруктураОтвет.Вставить("РегНомер",			XMLЗначение(Тип("Строка"),	СтруктураJSON.РегНомер));	
				СтруктураОтвет.Вставить("НазваниеКомпании",	XMLЗначение(Тип("Строка"),	СтруктураJSON.НазваниеКомпании));	
				СтруктураОтвет.Вставить("ТекущийТариф",		XMLЗначение(Тип("Строка"),	СтруктураJSON.ТекущийТариф));	
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураОтвет;
		
КонецФункции

Процедура ПолучитьСчетНаПродлениеПодписки(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	СтруктураJSON = Новый Структура;
	СтруктураJSON.Вставить("software",		XMLСтрока(ПараметрыПроцедуры.ПрограммныйПродукт));
	СтруктураJSON.Вставить("regnumber",		XMLСтрока(ПараметрыПроцедуры.РегистрационныйНомер));
	СтруктураJSON.Вставить("rateid",		XMLСтрока(ПараметрыПроцедуры.ИдентифкаторТарифа));
	СтруктураJSON.Вставить("startdate",		XMLСтрока(ПараметрыПроцедуры.ДатаНачала));
	СтруктураJSON.Вставить("months",		XMLСтрока(ПараметрыПроцедуры.КоличествоМесяцев));	
	СтруктураJSON.Вставить("count",			XMLСтрока(ПараметрыПроцедуры.Количество));	
	СтруктураJSON.Вставить("email",			XMLСтрока(ПараметрыПроцедуры.АдресПолучателя));

	ПараметрыHTTPЗапроса = CW_РаботаСВнешнимиРесурсамиСервер.ПодготовитьHTTPЗапрос("main_paymentinvoice", СтруктураJSON);

	Ответ = CW_РаботаСВнешнимиРесурсамиСервер.ПолучитьДанныеССервера(ПараметрыHTTPЗапроса.HTTPСоединение, ПараметрыHTTPЗапроса.HTTPЗапрос, "POST");   
	Если Ответ = Неопределено Тогда  
		КодСостояния	= 503;
		ТекстСостояния 	= "Сервис временно недоступен";
	Иначе
		КодСостояния	= Ответ.КодСостояния;
		ТекстСостояния 	= Ответ.ПолучитьТелоКакСтроку();
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("КодСостояния",	КодСостояния);
	СтруктураОтвета.Вставить("ТекстСостояния",	ТекстСостояния);
	
	ПоместитьВоВременноеХранилище(СтруктураОтвета, АдресРезультата);
	
КонецПроцедуры

//Профиль доступа   
Процедура ОбновитьПрофилиПользователей(ПараметрыПроцедуры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ПолучитьФункциональнуюОпцию("CW_ОбменГИСЭПДИспользуется") Тогда  
		
		Модуль_CW_ОбменГИСЭПДСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_ОбменГИСЭПДСервер");
		Профиль = Модуль_CW_ОбменГИСЭПДСервер.СоздатьПрофильДоступа();
		
		Запрос = новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	РегистрСведенийCW_ПараметрыПользователей.Пользователь КАК Пользователь,
		|	ЕСТЬNULL(ГруппыДоступа.Ссылка, НЕОПРЕДЕЛЕНО) КАК ПерсональнаяГруппаДоступа
		|ИЗ
		|	РегистрСведений.CW_ПараметрыПользователей КАК РегистрСведенийCW_ПараметрыПользователей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
		|		ПО РегистрСведенийCW_ПараметрыПользователей.Пользователь = ГруппыДоступа.Пользователь
		|			И (ГруппыДоступа.Профиль = &Профиль)
		|ГДЕ
		|	РегистрСведенийCW_ПараметрыПользователей.Группа = &Группа"; 
		
		Запрос.УстановитьПараметр("Группа", 	ПараметрыПроцедуры.ГруппаПользователей);
		Запрос.УстановитьПараметр("Профиль", 	Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл  
			
			Если ЗначениеЗаполнено(Выборка.ПерсональнаяГруппаДоступа) тогда
				ОбъектГруппаДоступа = Выборка.ПерсональнаяГруппаДоступа.ПолучитьОбъект();
				ОбъектГруппаДоступа.ПометкаУдаления = Ложь;   
			Иначе
				ОбъектГруппаДоступа = Справочники.ГруппыДоступа.СоздатьЭлемент();
				ОбъектГруппаДоступа.Родитель     	= Справочники.ГруппыДоступа.РодительПерсональныхГруппДоступа();
				ОбъектГруппаДоступа.Наименование 	= "Сервис ""Обмен с 1С-ЭПД""";
				ОбъектГруппаДоступа.Профиль 		= Профиль;
				ОбъектГруппаДоступа.Пользователь 	= Выборка.Пользователь;
				ОбъектГруппаДоступа.Комментарий 	= "Обеспечивает доступ к данным сервиса ""Обмен с 1С-ЭПД""";    
			КонецЕсли; 
			
			ОбъектГруппаДоступа.Пользователи.Очистить(); 
			
			Если ПараметрыПроцедуры.ОбменС1СЭПД Тогда
				ОбъектГруппаДоступа.Пользователи.Добавить().Пользователь = Выборка.Пользователь;
			КонецЕсли;	
			
			ОбъектГруппаДоступа.Записать();
			
		КонецЦикла;  
		
	КонецЕсли;   
	
КонецПроцедуры


Функция СоздатьПрофильДоступа() Экспорт
	           
	ИдентификаторПрофиля = CW_ОбменГИСЭПДСервер.ПолучитьИдентификаторПрофиляГруппыДоступа();
	
	СсылкаПрофиль = Справочники.ПрофилиГруппДоступа.НайтиПоРеквизиту("ИдентификаторПоставляемыхДанных", ИдентификаторПрофиля);  
	Если СсылкаПрофиль.Пустая() Тогда
		ИдентификаторОбъектаМетаданныхРоль = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Метаданные.Роли.CW_ОбменГИСЭПДИспользованиеСервиса);
		
		// создаем новый профиль доступа
		НовыйПрофиль = Справочники.ПрофилиГруппДоступа.СоздатьЭлемент();
		НовыйПрофиль.Наименование = "Сервис ""Обмен с 1С-ЭПД""";
		НовыйПрофиль.Комментарий  = "Доступ к сервису ""Обмен с 1С-ЭПД"""; 
		НовыйПрофиль.ИдентификаторПоставляемыхДанных =  ИдентификаторПрофиля;
		
		НоваяСтрока 		= НовыйПрофиль.Роли.Добавить();
		НоваяСтрока.Роль 	= ИдентификаторОбъектаМетаданныхРоль; 
		
		СтрокаНазначение = НовыйПрофиль.Назначение.Добавить();
		СтрокаНазначение.ТипПользователей = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка");
		
		НовыйПрофиль.Записать(); 
		
		СсылкаПрофиль = НовыйПрофиль.Ссылка;
		
	КонецЕсли; 
	
	Возврат СсылкаПрофиль;
	
КонецФункции   

Функция ПолучитьИдентификаторПрофиляГруппыДоступа() Экспорт
	
	Возврат Новый УникальныйИдентификатор("fd5bf7f1-c88d-405b-9251-0ae4d9257c87");
	
КонецФункции  
//Профиль доступа
